In [1]:
import pandas as pd

In [2]:
data_p = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 'retail_price':1000, 'sales':100}, 
{'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,'retail_price':75, 'sales':1000},
{'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35, 'retail_price':75, 'sales':500},
{'product_id':15, 'name':'banana', 'wholesale_price': 0.5,'retail_price':1, 'sales':200},
{'product_id':87, 'name':'sandwich', 'wholesale_price': 3,'retail_price':5, 'sales':300}])

In [3]:
data_p

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

Step 2: Calculate the Total Profit for each product using the formula

# net_revenue_per_product = (retail_price - wholesale price) * sales

In [4]:
data_p = data_p.assign(net_revenue_per_product=pd.Series(dtype='float64'))

In [5]:
data_p

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,500.0,1000,100,NaN
1,96,Python Workout,35.0,75,1000,NaN
2,97,Pandas Workout,35.0,75,500,NaN
3,15,banana,0.5,1,200,NaN
4,87,sandwich,3.0,5,300,NaN

In [6]:
def Total_p(row):
    return (row['retail_price'] - row['wholesale_price']) * row['sales']

data_p['net_revenue_per_product'] = data_p.apply(Total_p, axis=1)

In [7]:
data_p

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,500.0,1000,100,50000.0
1,96,Python Workout,35.0,75,1000,40000.0
2,97,Pandas Workout,35.0,75,500,20000.0
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,600.0

# Step 3: Determine the following

# How much total net revenue you received from all of these sales?

In [8]:
t_revenue_n = data_p['net_revenue_per_product'].sum()

In [9]:
t_revenue_n

110700.0

# What product is product retail price more than twice the wholesale price?

In [30]:
p_twice_r = data_p['retail_price'] > 2 * (data_p['wholesale_price'])
selected_product = data_p[p_twice_r]

In [31]:
p_twice_r

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [32]:
selected_product

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product,new_net_revenue
1,96,Python Workout,35.0,75,1000,40000.0,50500.0
2,97,Pandas Workout,35.0,75,500,20000.0,25250.0

In [35]:
for item_name in selected_product['name']:
    print(item_name)

Python Workout
Pandas Workout

How much did the store make from food vs. computers vs. books?

# for food

In [14]:
f_food = data_p[(data_p['name'] == 'banana') | (data_p['name'] == 'sandwich')]

In [15]:
 f_food

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,600.0

In [16]:
f_food_rev = f_food['net_revenue_per_product'].sum()

In [17]:
f_food_rev

700.0

# for computers

In [18]:
f_comp = data_p[(data_p['name'] == 'computer')]

In [19]:
f_comp

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product
0,23,computer,500.0,1000,100,50000.0

In [20]:
f_comp_rev = f_comp['net_revenue_per_product'].sum()

In [21]:
f_comp_rev

50000.0

# for books

In [22]:
f_books = data_p[(data_p['name'] == 'Python Workout') | (data_p['name'] == 'Pandas Workout')]

In [23]:

f_books_rev = f_books['net_revenue_per_product'].sum()

In [24]:
f_books_rev

60000.0

In [25]:
print(f'the store makes: {f_books_rev} from books\n')
print(f'the store makes: {f_comp_rev} from computers\n')
print(f'the store makes: {f_food_rev} from foods\n')

the store makes: 60000.0 from books

the store makes: 50000.0 from computers

the store makes: 700.0 from foods

# - Because your store is doing so well, youâ€™re able to negotiate
# a 30% discount on the wholesale price of goods. Calculate the new net revenue

In [26]:
def new_whole(row):
    return row['wholesale_price'] - (row['wholesale_price'] * 0.3)

In [27]:
def new_net_rev(row):
    new_whole_s = new_whole(row)
    return (row['retail_price'] - new_whole_s) * row['sales']

In [28]:
data_p['new_net_revenue'] = data_p.apply(new_net_rev, axis=1)

In [29]:
data_p

,product_id,name,wholesale_price,retail_price,sales,net_revenue_per_product,new_net_revenue
0,23,computer,500.0,1000,100,50000.0,65000.0
1,96,Python Workout,35.0,75,1000,40000.0,50500.0
2,97,Pandas Workout,35.0,75,500,20000.0,25250.0
3,15,banana,0.5,1,200,100.0,130.0
4,87,sandwich,3.0,5,300,600.0,870.0

In [33]:
t_revenue = data_p['new_net_revenue'].sum()

In [34]:
t_revenue

141750.0